# GetDeletedElementIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentChangedEventArgs..::..GetDeletedElementIds Method
DocumentChangedEventArgs Class See Also
---
Returns set of elements that were deleted from the document.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ICollection<ElementId> GetDeletedElementIds()
```

Visual Basic
---
```text
Public Function GetDeletedElementIds As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetDeletedElementIds()
```

# ### Return Value
The set of ElementId for elements that were deleted from the document.
# See Also
DocumentChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace